Repository: guilamu/guilamu-bug-reporter
Catalog: languages/guilamu-bug-reporter-*.po
Languages: fr_fr

source: Report a Bug
fr_fr: Signaler un bug

source: Processing...
fr_fr: Traitement en cours...

source: Report submitted successfully!
fr_fr: Rapport envoyé avec succès !

source: An error occurred. Please try again.
fr_fr: Une erreur s'est produite. Veuillez réessayer.

source: Please configure Bug Reporter settings first.
fr_fr: Veuillez d'abord configurer les paramètres du Bug Reporter.

source: Privacy & Data Disclosure
fr_fr: Confidentialité et données collectées

source: What Happened?
fr_fr: Que s'est-il passé ?

source: Expected Behavior
fr_fr: Comportement attendu

source: Steps to Reproduce
fr_fr: Étapes pour reproduire

source: Severity
fr_fr: Sévérité

source: Screenshot (Optional)
fr_fr: Capture d'écran (Optionnel)

source: Contact Email
fr_fr: Email de contact

source: Continue
fr_fr: Continuer

source: Back
fr_fr: Retour

source: Submit Report
fr_fr: Envoyer le rapport

source: Close
fr_fr: Fermer

source: Bug Reporter
fr_fr: Signalement de bugs

source: Guilamu Bug Reporter needs configuration. %s to get started.
fr_fr: Guilamu Bug Reporter nécessite une configuration. %s pour commencer.

source: Click here
fr_fr: Cliquez ici

source: Permission denied.
fr_fr: Permission refusée.

source: API key is required.
fr_fr: La clé API est requise.

source: Settings saved successfully.
fr_fr: Paramètres enregistrés avec succès.

source: Setup complete. AI responses are disabled.
fr_fr: Configuration terminée. Les réponses IA sont désactivées.

source: Welcome to Guilamu Bug Reporter!
fr_fr: Bienvenue dans Guilamu Bug Reporter !

source: Bug reports will be submitted as GitHub Issues. You can optionally enable AI-powered instant responses.
fr_fr: Les rapports de bugs seront soumis en tant que tickets GitHub. Vous pouvez activer optionnellement les réponses instantanées par IA.

source: AI-Powered Responses (Optional)
fr_fr: Réponses par IA (Optionnel)

source: Enable AI to provide instant troubleshooting suggestions when users submit bug reports. Choose between POE or Google Gemini.
fr_fr: Activez l'IA pour fournir des suggestions de dépannage instantanées lorsque les utilisateurs soumettent des rapports de bugs. Choisissez entre POE ou Google Gemini.

source: Choose an AI Provider
fr_fr: Choisissez un fournisseur d'IA

source: Free tier available. Supports Claude, GPT, and more.
fr_fr: Niveau gratuit disponible. Supporte Claude, GPT, et plus.

source: Free tier with generous limits. Fast and capable.
fr_fr: Niveau gratuit avec des limites généreuses. Rapide et performant.

source: This takes less than 1 minute and is completely FREE!
fr_fr: Cela prend moins d'1 minute et c'est entièrement GRATUIT !

source: Go to poe.com and create a free account
fr_fr: Allez sur poe.com et créez un compte gratuit

source: Navigate to: Settings API
fr_fr: Allez dans : Paramètres API

source: Click "Generate API key"
fr_fr: Cliquez sur Générer une clé API

source: Copy and paste it below
fr_fr: Copiez et collez-la ci-dessous

source: Create Free POE Account
fr_fr: Créer un compte POE gratuit

source: Get Your API Key
fr_fr: Obtenir votre clé API

source: POE API Key
fr_fr: Clé API POE

source: Paste your API key here
fr_fr: Collez votre clé API ici

source: AI Model
fr_fr: Modèle IA

source: Enter API key first...
fr_fr: Entrez d'abord la clé API...

source: Auto-detected: Latest Claude-Sonnet
fr_fr: Détection automatique : Dernier Claude-Sonnet

source: Google Gemini offers a generous free tier no credit card required!
fr_fr: Google Gemini offre un niveau gratuit généreux aucune carte bancaire requise !

source: Go to Google AI Studio
fr_fr: Allez sur Google AI Studio

source: Sign in with your Google account
fr_fr: Connectez-vous avec votre compte Google

source: Click "Get API key" "Create API key"
fr_fr: Cliquez sur Get API key Create API key

source: Get Your Gemini API Key
fr_fr: Obtenir votre clé API Gemini

source: Gemini API Key
fr_fr: Clé API Gemini

source: Gemini 2.0 Flash is recommended for most use cases.
fr_fr: Gemini 2.0 Flash est recommandé pour la plupart des cas d'utilisation.

source: Complete Setup with AI
fr_fr: Terminer la configuration avec IA

source: Skip AI Setup
fr_fr: Passer la configuration IA

source: You can always enable or change AI settings later from this page.
fr_fr: Vous pouvez toujours activer ou modifier les paramètres IA plus tard depuis cette page.

source: Saving...
fr_fr: Enregistrement...

source: AI Settings
fr_fr: Paramètres IA

source: AI Responses
fr_fr: Réponses IA

source: Enable AI-powered instant responses to bug reports
fr_fr: Activer les réponses instantanées par IA aux rapports de bugs

source: AI Provider
fr_fr: Fournisseur IA

source: Get API Key
fr_fr: Obtenir la clé API

source: Model is auto-selected when you update your API key.
fr_fr: Le modèle est sélectionné automatiquement lorsque vous mettez à jour votre clé API.

source: Registered Plugins
fr_fr: Extensions enregistrées

source: No plugins have registered with Bug Reporter yet.
fr_fr: Aucune extension n'est encore enregistrée avec Bug Reporter.

source: Plugin
fr_fr: Extension

source: GitHub Repo
fr_fr: Dépôt GitHub

source: Status
fr_fr: Statut

source: Enabled (%s)
fr_fr: Activé (%s)

source: Disabled
fr_fr: Désactivé

source: POE API
fr_fr: API POE

source: Configured
fr_fr: Configuré

source: Not configured
fr_fr: Non configuré

source: Gemini API
fr_fr: API Gemini

source: GitHub API
fr_fr: API GitHub

source: Pre-configured
fr_fr: Pré-configuré

source: GitHub token is bundled with the plugin.
fr_fr: Le token GitHub est inclus dans l'extension.

source: Submitting your report...
fr_fr: Envoi de votre rapport...

source: AI Response
fr_fr: Réponse de l'IA

source: What we collect:
fr_fr: Ce que nous collectons :

source: Your answers to the questions below
fr_fr: Vos réponses aux questions ci-dessous

source: System information (WordPress version, PHP version, active plugins, etc.)
fr_fr: Informations système (version WordPress, version PHP, extensions actives, etc.)

source: If you upload a screenshot, it will be stored in your WordPress Media Library
fr_fr: Si vous téléchargez une capture d'écran, elle sera stockée dans votre bibliothèque de médias WordPress

source: Where it goes:
fr_fr: Où vont les données :

source: A public GitHub Issue will be created in the plugin's repository
fr_fr: Un ticket GitHub public sera créé dans le dépôt de l'extension

source: An AI will analyze your report and provide immediate suggestions
fr_fr: Une IA analysera votre rapport et fournira des suggestions immédiates

source: Your email will NOT be published (stored privately for follow-up only)
fr_fr: Votre email ne sera PAS publié (stocké en privé uniquement pour le suivi)

source: I understand and wish to proceed
fr_fr: Je comprends et souhaite continuer

source: What happened?
fr_fr: Que s'est-il passé ?

source: Describe the issue you encountered. Be as specific as possible.
fr_fr: Décrivez le problème rencontré. Soyez aussi précis que possible.

source: Example: When I click Save, the page refreshes but my changes are not saved. No error message appears.
fr_fr: Exemple : Quand je clique sur Enregistrer, la page se rafraîchit mais mes modifications ne sont pas sauvegardées. Aucun message d'erreur n'apparaît.

source: What did you expect to happen?
fr_fr: Qu'attendiez-vous qu'il se passe ?

source: Describe the behavior you expected instead.
fr_fr: Décrivez le comportement que vous attendiez à la place.

source: Example: I expected my changes to be saved and to see a success notification.
fr_fr: Exemple : Je m'attendais à ce que mes modifications soient enregistrées et à voir une notification de succès.

source: List the exact steps to recreate this issue.
fr_fr: Listez les étapes exactes pour reproduire ce problème.

source: 1. Go to Form Settings 2. Change the field label 3. Click 'Save' 4. Page refreshes but changes are lost
fr_fr: 1. Aller dans les paramètres du formulaire 2. Modifier le libellé du champ 3. Cliquer sur Enregistrer 4. La page se rafraîchit mais les modifications sont perdues

source: How severe is this issue?
fr_fr: Quelle est la gravité de ce problème ?

source: Help us prioritize by indicating how this affects your work.
fr_fr: Aidez-nous à prioriser en indiquant comment cela affecte votre travail.

source: Blocking
fr_fr: Bloquant

source: Annoying
fr_fr: Gênant

source: Minor
fr_fr: Mineur

source: A screenshot can help us understand the issue better.
fr_fr: Une capture d'écran peut nous aider à mieux comprendre le problème.

source: Click to upload a screenshot
fr_fr: Cliquez pour télécharger une capture d'écran

source: Max 5MB. JPG, PNG, GIF, or WebP.
fr_fr: Max 5 Mo. JPG, PNG, GIF ou WebP.

source: We'll only use this to follow up if needed. It will NOT appear publicly.
fr_fr: Nous l'utiliserons uniquement pour un suivi si nécessaire. Il n'apparaîtra PAS publiquement.

source: your@email.com
fr_fr: votre@email.com

source: Back
fr_fr: Retour

source: View Issue on GitHub
fr_fr: Voir le ticket sur GitHub

source: Continue
fr_fr: Continuer

source: Please fill in all required fields.
fr_fr: Veuillez remplir tous les champs obligatoires.

source: Invalid plugin.
fr_fr: Extension invalide.

source: Your bug report has been submitted successfully!
fr_fr: Votre rapport de bug a été envoyé avec succès !

source: No file uploaded.
fr_fr: Aucun fichier téléchargé.

source: Invalid file type. Please upload an image.
fr_fr: Type de fichier invalide. Veuillez télécharger une image.

source: File too large. Maximum size is 5MB.
fr_fr: Fichier trop volumineux. Taille maximum : 5 Mo.

source: Gemini API error: %d
fr_fr: Erreur API Gemini : %d

source: POE API error: %d
fr_fr: Erreur API POE : %d

source: GitHub token is not configured.
fr_fr: Le token GitHub n'est pas configuré.

source: GitHub API error: %d
fr_fr: Erreur API GitHub : %d
